ACCESS_KEY = 'bcfa1b8b61624905c457d32c4ec62718' # ключ доступа к API exchangeratesapi.io
TOKEN = "5147872512:AAFSmSG4IrwOhJmB-EUleUS0Bx5JZTu39s0" # токен бота @Ventagoy_Bot
HELP_MESS = 'Для просмотра списка доступных валют введите команду /values \nДля выполнения \
конвертации введите запрос формата\n(сумма исходной валюты/исходная валюта/валюта \
в которую надо конвертировать)\nПример--> 100/доллар/рубль'
# строка помощи
keys = {'доллар': 'USD',
        'евро': 'EUR',
        'рубль': 'RUB',
        'белорусский рубль': 'BYN',
        'гривна': 'UAH',
        'иена': 'JPY',
        'юань': 'CNY',
        'сом': 'KGS'
        }
# словарь тикетов валют
